newwms_gift/src/Catalogs/ит_WMS_АссортиментныеУчасткиСклада/ит_WMS_АссортиментныеУчасткиСклада.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ит_WMS_АссортиментныеУчасткиСклада</name>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СоставЯчеек</name>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>CatalogRef.итСкладскиеЯчейки</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

newwms_gift/src/Catalogs/ит_WMS_АссортиментныеУчасткиСклада/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура Подбор(Команда)
	СтруктураПараметров=новый Структура;
	СтруктураПараметров.Вставить("МассивЯчеекИсключения",МассивЯчеекИсключения());
	ОткрытьФорму("Справочник.ит_WMS_АссортиментныеУчасткиСклада.Форма.ФормаПодбораЯчеек",СтруктураПараметров,ЭтаФорма);
КонецПроцедуры

Функция  МассивЯчеекИсключения()
	Возврат Объект.СоставЯчеек.Выгрузить().ВыгрузитьКолонку("Ячейка");
КонецФункции

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
		Если  ИсточникВыбора.ИмяФормы="Справочник.ит_WMS_АссортиментныеУчасткиСклада.Форма.ФормаПодбораЯчеек" Тогда 
			Для Каждого стр из ВыбранноеЗначение.МассивЯчеек цикл
				НоваяСтрока=Объект.СоставЯчеек.Добавить();
				НоваяСтрока.Ячейка=стр;
				//НоваяСтрока.ВидСкладскойДеятельности=ВыбранноеЗначение.ВидСкладскойДеятельности;
				КонецЦикла;
			КонецЕсли;
КонецПроцедуры
